GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Inc/timer_defines.h
/**
 * @file	timer_defines.h
 * @author	Shrey Shah
 * @brief	Timer Driver Selector and Validation Defines
 * @version	v1.0
 * @date	07-06-2026
 *
 * @details
 * This header owns public Timer selector macros and pure validation helpers.
 * It does not own Timer typedef aliases; those live in `timer_data_types.h`.
 *
 * Keep this file free of direct Timer register reads/writes. STM32F1 register
 * field placement belongs in the Timer codec layer. Register access belongs in
 * the Timer LL layer.
 *
 * @note During the migration step, this header is intentionally not wired into
 * `timer.h` until the legacy Timer selector enums are removed from Core.
 */

#ifndef TIMER_DEFINES_H_
#define TIMER_DEFINES_H_

// ==================================================================================================== //
//												Includes												//
// ==================================================================================================== //
#include "stm32f1xx_base_address.h"
#include "stm32f1xx_timer.h"
#include "stm32f1xx_utils.h"
#include "timer_data_types.h"

// --- C++ Compatibility ---
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/**
 * @defgroup TIM Timer Driver
 * @brief STM32F1 general-purpose Timer driver stack
 */

/**
 * @addtogroup TIM_03_Driver
 * @{
 */

/**
 * @brief Timer public selector and validation macros
 * @defgroup TIM_03_Driver_02_Defines Timer Driver Selector and Validation Defines
 * @ingroup TIM_03_Driver
 * @details
 * This group contains public Timer selector macros and pure validation helpers.
 * It deliberately excludes direct register access helpers and raw register
 * image staging.
 * @{
 */

// ==================================================================================================== //
//										Timer Instance Selectors										//
// ==================================================================================================== //

/**
 * @brief Timer instance validation helpers
 * @defgroup TIM_03_Driver_02_Defines_01_Instance Timer Instance Defines
 * @ingroup TIM_03_Driver_02_Defines
 * @{
 */

/** @brief First supported general-purpose Timer instance index @def TIM_INSTANCE_INDEX_FIRST */
#define TIM_INSTANCE_INDEX_FIRST						((timer_instance_index_t) 0x00U)
/** @brief `TIM2` instance index @def TIM_INSTANCE_INDEX_TIM2 */
#define TIM_INSTANCE_INDEX_TIM2							((timer_instance_index_t) 0x00U)
/** @brief `TIM3` instance index @def TIM_INSTANCE_INDEX_TIM3 */
#define TIM_INSTANCE_INDEX_TIM3							((timer_instance_index_t) 0x01U)
/** @brief `TIM4` instance index @def TIM_INSTANCE_INDEX_TIM4 */
#define TIM_INSTANCE_INDEX_TIM4							((timer_instance_index_t) 0x02U)
/** @brief `TIM5` instance index @def TIM_INSTANCE_INDEX_TIM5 */
#define TIM_INSTANCE_INDEX_TIM5							((timer_instance_index_t) 0x03U)
/** @brief Last supported general-purpose Timer instance index @def TIM_INSTANCE_INDEX_LAST */
#define TIM_INSTANCE_INDEX_LAST							TIM_INSTANCE_INDEX_TIM5
/** @brief Number of supported general-purpose Timer instances @def TIM_INSTANCE_COUNT */
#define TIM_INSTANCE_COUNT								((timer_instance_index_t) (TIM_INSTANCE_INDEX_LAST + 1U))
/** @brief Invalid Timer instance index sentinel @def TIM_INSTANCE_INDEX_INVALID */
#define TIM_INSTANCE_INDEX_INVALID						TIM_INSTANCE_COUNT

/**
 * @brief Checks whether a Timer instance index is supported by this driver
 * @param[in]	instanceIndex	Timer instance index to check
 * @returns Timer instance-index validity status
 * @retval - `0x00U`: @p instanceIndex is outside the supported range
 * @retval - `0x01U`: @p instanceIndex is supported
 * @def TIM_INSTANCE_INDEX_IS_VALID
 */
#define TIM_INSTANCE_INDEX_IS_VALID(instanceIndex)		\
	(((uint32_t) (instanceIndex)) <= ((uint32_t) TIM_INSTANCE_INDEX_LAST))

/**
 * @brief Checks whether a Timer peripheral instance is supported by this driver
 * @param[in]	TIMx	Timer peripheral instance
 * Accepted values:
 * - @ref `TIM2`
 * - @ref `TIM3`
 * - @ref `TIM4`
 * - @ref `TIM5`
 * @returns Timer instance validity status
 * @retval - `0x00U`: @p TIMx is not supported by this Timer driver pass
 * @retval - `0x01U`: @p TIMx is a supported general-purpose Timer instance
 * @def TIM_INSTANCE_IS_VALID
 */
#define TIM_INSTANCE_IS_VALID(TIMx)								\
(																\
	(((uintptr_t) (TIMx)) == ((uintptr_t) TIM2_BASE_ADDRESS)) ||	\
	(((uintptr_t) (TIMx)) == ((uintptr_t) TIM3_BASE_ADDRESS)) ||	\
	(((uintptr_t) (TIMx)) == ((uintptr_t) TIM4_BASE_ADDRESS)) ||	\
	(((uintptr_t) (TIMx)) == ((uintptr_t) TIM5_BASE_ADDRESS))		\
)

/**
 * @brief Converts a supported Timer instance to a zero-based instance index
 * @param[in] TIMx Timer peripheral instance
 * Accepted values:
 * - @ref `TIM2`
 * - @ref `TIM3`
 * - @ref `TIM4`
 * - @ref `TIM5`
 * @returns Timer instance index
 * @retval - @ref `TIM_INSTANCE_INDEX_TIM2`: @p TIMx is @ref `TIM2`
 * @retval - @ref `TIM_INSTANCE_INDEX_TIM3`: @p TIMx is @ref `TIM3`
 * @retval - @ref `TIM_INSTANCE_INDEX_TIM4`: @p TIMx is @ref `TIM4`
 * @retval - @ref `TIM_INSTANCE_INDEX_TIM5`: @p TIMx is @ref `TIM5`
 * @retval - @ref `TIM_INSTANCE_INDEX_INVALID`: @p TIMx is not supported
 */
__STATIC_FORCEINLINE timer_instance_index_t TIM_InstanceToIndex(const TIM_TypeDef* const TIMx)
{
	// Local Variables
	timer_instance_index_t instanceIndex = TIM_INSTANCE_INDEX_INVALID;
	const uintptr_t timerAddress = (uintptr_t) TIMx;
	//! Determine Timer Base Address and Instance Index
	switch (timerAddress)
	{
		case TIM2_BASE_ADDRESS:
		{
			instanceIndex = TIM_INSTANCE_INDEX_TIM2;
			break;
		}
		case TIM3_BASE_ADDRESS:
		{
			instanceIndex = TIM_INSTANCE_INDEX_TIM3;
			break;
		}
		case TIM4_BASE_ADDRESS:
		{
			instanceIndex = TIM_INSTANCE_INDEX_TIM4;
			break;
		}
		case TIM5_BASE_ADDRESS:
		{
			instanceIndex = TIM_INSTANCE_INDEX_TIM5;
			break;
		}
		default:
		{
			instanceIndex = TIM_INSTANCE_INDEX_INVALID;
			break;
		}
	}

	return instanceIndex;
}

/** @} */ // TIM_03_Driver_02_Defines_01_Instance

// ==================================================================================================== //
//											Timer Default Values											//
// ==================================================================================================== //

/**
 * @brief Timer default preset values
 * @defgroup TIM_03_Driver_02_Defines_02_Defaults Timer Default Defines
 * @ingroup TIM_03_Driver_02_Defines
 * @{
 */

