GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Inc/timer_defines.h
/** @brief Default prescaler for 10 kHz timer tick at 72 MHz timer clock @def TIMx_DEFAULT_10kHz_PSC */
#define TIMx_DEFAULT_10kHz_PSC						((timer_prescaler_t) 7199U)
/** @brief Default auto-reload value for 10 kHz periodic count window @def TIMx_DEFAULT_10kHz_ARR */
#define TIMx_DEFAULT_10kHz_ARR						((timer_auto_reload_t) 9999U)
/** @brief Default prescaler for 1 MHz timer tick at 72 MHz timer clock @def TIMx_DEFAULT_1MHz_PSC */
#define TIMx_DEFAULT_1MHz_PSC						((timer_prescaler_t) 71U)
/** @brief Default auto-reload value for 1 MHz periodic count window @def TIMx_DEFAULT_1MHz_ARR */
#define TIMx_DEFAULT_1MHz_ARR						((timer_auto_reload_t) 999U)
/** @brief Default timer counter start value @def TIMx_DEFAULT_CNT */
#define TIMx_DEFAULT_CNT							((timer_counter_value_t) 0U)

/** @} */ // TIM_03_Driver_02_Defines_02_Defaults

// ==================================================================================================== //
//											Timer Channels												//
// ==================================================================================================== //

/**
 * @brief Timer channel bit-mask selectors and helpers
 * @defgroup TIM_03_Driver_02_Defines_03_Channel Timer Channel Defines
 * @ingroup TIM_03_Driver_02_Defines
 * @{
 */

/** @brief First valid zero-based Timer channel index @def TIM_CHANNEL_INDEX_FIRST */
#define TIM_CHANNEL_INDEX_FIRST						((timer_channel_index_t) 0U)
/** @brief Last valid zero-based Timer channel index @def TIM_CHANNEL_INDEX_LAST */
#define TIM_CHANNEL_INDEX_LAST						((timer_channel_index_t) 3U)
/** @brief Number of Timer channels available on one general-purpose Timer @def TIM_CHANNEL_COUNT */
#define TIM_CHANNEL_COUNT							((timer_channel_index_t) (TIM_CHANNEL_INDEX_LAST + 1U))
/** @brief Invalid Timer channel index sentinel @def TIM_CHANNEL_INDEX_INVALID */
#define TIM_CHANNEL_INDEX_INVALID					TIM_CHANNEL_COUNT

/**
 * @brief Checks if a Timer channel index is inside the supported channel-index range
 * @param[in]	channelIndex	Zero-based Timer channel index to check
 * @returns Channel-index validity status
 * @retval - `0x00U`: @p channelIndex is outside `0..3`
 * @retval - `0x01U`: @p channelIndex is inside `0..3`
 * @def TIM_CHANNEL_INDEX_IS_VALID
 */
#define TIM_CHANNEL_INDEX_IS_VALID(channelIndex)	\
	(((uint32_t) (channelIndex)) <= ((uint32_t) TIM_CHANNEL_INDEX_LAST))

/**
 * @brief Converts a zero-based Timer channel index to a single-channel mask
 * @param[in]	channelIndex	Zero-based Timer channel index
 * @returns Timer channel mask generated from @p channelIndex
 * @retval - @ref `TIMx_CHANNEL_1` through @ref `TIMx_CHANNEL_4`: @p channelIndex is valid
 * @def TIM_CHANNEL_INDEX_TO_MASK
 */
#define TIM_CHANNEL_INDEX_TO_MASK(channelIndex)		((timer_channel_t) REG_BIT_MASK(channelIndex))

/** @brief No timer channel selected @def TIMx_CHANNEL_NONE */
#define TIMx_CHANNEL_NONE							((timer_channel_t) 0x00U)
/** @brief Timer channel 1 selector @def TIMx_CHANNEL_1 */
#define TIMx_CHANNEL_1								TIM_CHANNEL_INDEX_TO_MASK(0U)
/** @brief Timer channel 2 selector @def TIMx_CHANNEL_2 */
#define TIMx_CHANNEL_2								TIM_CHANNEL_INDEX_TO_MASK(1U)
/** @brief Timer channel 3 selector @def TIMx_CHANNEL_3 */
#define TIMx_CHANNEL_3								TIM_CHANNEL_INDEX_TO_MASK(2U)
/** @brief Timer channel 4 selector @def TIMx_CHANNEL_4 */
#define TIMx_CHANNEL_4								TIM_CHANNEL_INDEX_TO_MASK(3U)
/** @brief All timer channels selected @def TIMx_CHANNEL_ALL */
#define TIMx_CHANNEL_ALL							((timer_channel_t) 0x0FU)

/**
 * @brief Checks if a Timer channel mask selects at least one channel
 * @param[in]	channelMask	Timer channel mask to check
 * @returns Channel-selection presence status
 * @retval - `0x00U`: @p channelMask selects no channel
 * @retval - `0x01U`: @p channelMask selects at least one channel
 * @def TIM_CHANNEL_MASK_HAS_ANY_CHANNEL
 */
#define TIM_CHANNEL_MASK_HAS_ANY_CHANNEL(channelMask)	\
	(((timer_channel_t) (channelMask)) != TIMx_CHANNEL_NONE)

/**
 * @brief Checks if a Timer channel mask contains only supported channel bits
 * @param[in]	channelMask	Timer channel mask to check
 * @returns Supported-range status
 * @retval - `0x00U`: @p channelMask contains bits outside @ref `TIMx_CHANNEL_ALL`
 * @retval - `0x01U`: @p channelMask contains only supported channel bits
 * @def TIM_CHANNEL_MASK_HAS_ONLY_VALID_CHANNELS
 */
#define TIM_CHANNEL_MASK_HAS_ONLY_VALID_CHANNELS(channelMask)	\
	((((uint32_t) (channelMask)) & (~((uint32_t) TIMx_CHANNEL_ALL))) == 0x00000000UL)

/**
 * @brief Checks if a Timer channel mask is valid and non-empty
 * @param[in]	channelMask	Timer channel mask to check
 * @returns Channel-mask validity status
 * @retval - `0x00U`: @p channelMask is empty or contains unsupported bits
 * @retval - `0x01U`: @p channelMask selects one or more supported channels
 * @def TIM_CHANNEL_MASK_IS_VALID
 */
#define TIM_CHANNEL_MASK_IS_VALID(channelMask)		\
	(TIM_CHANNEL_MASK_HAS_ANY_CHANNEL(channelMask) && TIM_CHANNEL_MASK_HAS_ONLY_VALID_CHANNELS(channelMask))

/**
 * @brief Checks if a Timer channel mask has zero or one bit set
 * @param[in]	channelMask	Timer channel mask to check
 * @returns At-most-one-bit status
 * @retval - `0x00U`: @p channelMask contains multiple selected channels
 * @retval - `0x01U`: @p channelMask is zero or contains exactly one channel
 * @def TIM_CHANNEL_MASK_HAS_AT_MOST_ONE_CHANNEL
 */
#define TIM_CHANNEL_MASK_HAS_AT_MOST_ONE_CHANNEL(channelMask)	\
	((((uint32_t) (channelMask)) & (((uint32_t) (channelMask)) - 1UL)) == 0x00000000UL)

/**
 * @brief Checks if a Timer channel mask contains exactly one selected channel
 * @param[in]	channelMask	Timer channel mask to check
 * @returns Single-channel selection status
 * @retval - `0x00U`: @p channelMask is empty or selects multiple channels
 * @retval - `0x01U`: @p channelMask selects exactly one supported channel
 * @def TIM_CHANNEL_MASK_HAS_ONLY_ONE_VALID_CHANNEL
 */
#define TIM_CHANNEL_MASK_HAS_ONLY_ONE_VALID_CHANNEL(channelMask)	\
	(TIM_CHANNEL_MASK_IS_VALID(channelMask) && TIM_CHANNEL_MASK_HAS_AT_MOST_ONE_CHANNEL(channelMask))

/**
 * @brief Returns the channel index for a single-channel mask
 * @param[in]	channelMask	Timer single-channel mask ( @ref `TIMx_CHANNEL_1` ... @ref `TIMx_CHANNEL_ALL`)
 * @returns Timer channel index decoded from @p channelMask
 * @retval - `0U..3U`: Valid Timer channel index
 * @retval - @ref `TIM_CHANNEL_INDEX_INVALID`: Invalid, empty, or multi-channel mask
 */
__STATIC_FORCEINLINE timer_channel_index_t TIM_ChannelMaskToIndex(const timer_channel_t channelMask)
{
	// Local Variables
	timer_channel_t channelMaskImage = channelMask;
	timer_channel_index_t channelIndex = TIM_CHANNEL_INDEX_FIRST;

	// Validate Input
	if (TIM_CHANNEL_MASK_HAS_ONLY_ONE_VALID_CHANNEL(channelMask) == 0x00U)
	{
		return TIM_CHANNEL_INDEX_INVALID;
	}

	//! Right-shift the single-channel mask until it matches the first channel mask
	//! Count the shifts as the channel index
	while (channelMaskImage != TIMx_CHANNEL_1)
	{
		channelMaskImage = (timer_channel_t) (((uint32_t) channelMaskImage) >> 1U);
		++channelIndex;
	}

	return channelIndex;
}

/**
 * @brief Extracts the lowest selected channel from a Timer channel mask
 * @param[in]	channelMask	Timer channel mask image
 * @returns Single-channel mask for the lowest selected channel
 * @retval - @ref `TIMx_CHANNEL_NONE`: @p channelMask has no selected channel
 * @retval - @ref `TIMx_CHANNEL_1` through @ref `TIMx_CHANNEL_4`: Lowest selected channel mask
 */
__STATIC_FORCEINLINE timer_channel_t TIM_ChannelMaskExtractLowestChannel(const timer_channel_t channelMask)
{
	return (timer_channel_t) (((uint32_t) channelMask) & (0UL - ((uint32_t) channelMask)));
}

/**
 * @brief Removes one selected channel from a Timer channel mask image
 * @param[in,out]	pChannelMask	Timer channel mask image to update
 * @param[in]		channel			Timer single-channel mask to remove
 * @returns Remove status
 * @retval - @ref `DRIVER_STATUS_SUCCESS`: @p channel was removed from @p pChannelMask
 * @retval - @ref `DRIVER_STATUS_ERROR_NULL_PTR`: @p pChannelMask is `NULL`
 * @retval - @ref `DRIVER_STATUS_ERROR_INVALID_ARG`: @p channel is not a single valid channel selected in @p pChannelMask
 */
__STATIC_FORCEINLINE driver_status_t TIM_ChannelMaskRemoveChannel
(
	timer_channel_t* const	pChannelMask,
	const timer_channel_t		channel
)
{
	// Validate Input
	if (pChannelMask == NULL)
	{
		return DRIVER_STATUS_ERROR_NULL_PTR;
	}
	if
	(
		(TIM_CHANNEL_MASK_IS_VALID(*pChannelMask) == 0x00U) ||
		(TIM_CHANNEL_MASK_HAS_ONLY_ONE_VALID_CHANNEL(channel) == 0x00U) ||
		((((uint32_t) (*pChannelMask)) & ((uint32_t) channel)) == 0x00000000UL)
	)
	{
		return DRIVER_STATUS_ERROR_INVALID_ARG;
	}

	//! Clear the specified channel bit from the channel mask image
	*pChannelMask = (timer_channel_t) (((uint32_t) (*pChannelMask)) & ~((uint32_t) channel));
	return DRIVER_STATUS_SUCCESS;
}

/** @} */ // TIM_03_Driver_02_Defines_03_Channel

// ==================================================================================================== //
//										Timer Counter Selectors										//
// ==================================================================================================== //

/**
 * @brief Timer counter mode, direction, and update selectors
 * @defgroup TIM_03_Driver_02_Defines_04_Counter Timer Counter Defines
 * @ingroup TIM_03_Driver_02_Defines
 * @{
 */

