GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Inc/timer_defines.h
/** @brief Edge-aligned mode @def TIMx_MODE_NORMAL */
#define TIMx_MODE_NORMAL									((timer_count_mode_t) 0x00U)
/** @brief Center-aligned mode 1, interrupt flag set while down-counting @def TIMx_MODE_ALTERNATE_INTERRUPT_DOWN_COUNTING */
#define TIMx_MODE_ALTERNATE_INTERRUPT_DOWN_COUNTING			((timer_count_mode_t) 0x01U)
/** @brief Center-aligned mode 2, interrupt flag set while up-counting @def TIMx_MODE_ALTERNATE_INTERRUPT_UP_COUNTING */
#define TIMx_MODE_ALTERNATE_INTERRUPT_UP_COUNTING			((timer_count_mode_t) 0x02U)
/** @brief Center-aligned mode 3, interrupt flag set while up-counting and down-counting @def TIMx_MODE_ALTERNATE_INTERRUPT_BOTH_COUNTING */
#define TIMx_MODE_ALTERNATE_INTERRUPT_BOTH_COUNTING			((timer_count_mode_t) 0x03U)

/**
 * @brief Checks whether a Timer count mode selector is valid
 * @param[in]	mode	Timer count mode selector
 * @returns Count mode validity status
 * @retval - `0x00U`: @p mode is not supported
 * @retval - `0x01U`: @p mode is supported
 * @def TIM_COUNT_MODE_IS_VALID
 */
#define TIM_COUNT_MODE_IS_VALID(mode)												\
(																					\
	(((timer_count_mode_t) (mode)) == TIMx_MODE_NORMAL) ||							\
	(((timer_count_mode_t) (mode)) == TIMx_MODE_ALTERNATE_INTERRUPT_DOWN_COUNTING) ||	\
	(((timer_count_mode_t) (mode)) == TIMx_MODE_ALTERNATE_INTERRUPT_UP_COUNTING) ||	\
	(((timer_count_mode_t) (mode)) == TIMx_MODE_ALTERNATE_INTERRUPT_BOTH_COUNTING)	\
)

/** @brief Timer counts up @def TIMx_DIR_COUNT_UP */
#define TIMx_DIR_COUNT_UP								((timer_direction_t) 0x00U)
/** @brief Timer counts down @def TIMx_DIR_COUNT_DOWN */
#define TIMx_DIR_COUNT_DOWN								((timer_direction_t) 0x01U)

/**
 * @brief Checks whether a Timer direction selector is valid
 * @param[in]	direction	Timer direction selector
 * @returns Direction validity status
 * @retval - `0x00U`: @p direction is not supported
 * @retval - `0x01U`: @p direction is supported
 * @def TIM_DIRECTION_IS_VALID
 */
#define TIM_DIRECTION_IS_VALID(direction)						\
(																\
	(((timer_direction_t) (direction)) == TIMx_DIR_COUNT_UP) ||	\
	(((timer_direction_t) (direction)) == TIMx_DIR_COUNT_DOWN)	\
)

/** @brief Disable auto-reload preload @def TIMx_ARPE_DISABLE */
#define TIMx_ARPE_DISABLE								((timer_arpe_t) 0x00U)
/** @brief Enable auto-reload preload @def TIMx_ARPE_ENABLE */
#define TIMx_ARPE_ENABLE								((timer_arpe_t) 0x01U)

/**
 * @brief Checks whether a Timer auto-reload preload selector is valid
 * @param[in]	arpe	Timer auto-reload preload selector
 * @returns Auto-reload preload validity status
 * @retval - `0x00U`: @p arpe is not supported
 * @retval - `0x01U`: @p arpe is supported
 * @def TIM_ARPE_IS_VALID
 */
#define TIM_ARPE_IS_VALID(arpe)							\
(														\
	(((timer_arpe_t) (arpe)) == TIMx_ARPE_DISABLE) ||		\
	(((timer_arpe_t) (arpe)) == TIMx_ARPE_ENABLE)			\
)

/** @brief Disable one-pulse mode @def TIMx_OPM_DISABLE */
#define TIMx_OPM_DISABLE								((timer_opm_t) 0x00U)
/** @brief Enable one-pulse mode @def TIMx_OPM_ENABLE */
#define TIMx_OPM_ENABLE									((timer_opm_t) 0x01U)

/**
 * @brief Checks whether a Timer one-pulse selector is valid
 * @param[in]	onePulse	Timer one-pulse selector
 * @returns One-pulse selector validity status
 * @retval - `0x00U`: @p onePulse is not supported
 * @retval - `0x01U`: @p onePulse is supported
 * @def TIM_OPM_IS_VALID
 */
#define TIM_OPM_IS_VALID(onePulse)						\
(														\
	(((timer_opm_t) (onePulse)) == TIMx_OPM_DISABLE) ||	\
	(((timer_opm_t) (onePulse)) == TIMx_OPM_ENABLE)		\
)

/** @brief Update event may be generated by any update source @def TIMx_UPDATE_SOURCE_ANY */
#define TIMx_UPDATE_SOURCE_ANY							((timer_update_source_t) 0x00U)
/** @brief Update request source limited to overflow/underflow or DMA request @def TIMx_UPDATE_SOURCE_OVF_DMA */
#define TIMx_UPDATE_SOURCE_OVF_DMA						((timer_update_source_t) 0x01U)

/**
 * @brief Checks whether a Timer update-source selector is valid
 * @param[in]	updateSource	Timer update-source selector
 * @returns Update-source validity status
 * @retval - `0x00U`: @p updateSource is not supported
 * @retval - `0x01U`: @p updateSource is supported
 * @def TIM_UPDATE_SOURCE_IS_VALID
 */
#define TIM_UPDATE_SOURCE_IS_VALID(updateSource)							\
(																			\
	(((timer_update_source_t) (updateSource)) == TIMx_UPDATE_SOURCE_ANY) ||	\
	(((timer_update_source_t) (updateSource)) == TIMx_UPDATE_SOURCE_OVF_DMA)	\
)

/** @brief Timer clock division is `t_DTS = t_CK_INT` @def TIMx_CKD_CLK_FREQ */
#define TIMx_CKD_CLK_FREQ								((timer_clock_division_t) 0x00U)
/** @brief Timer clock division is `t_DTS = 2 * t_CK_INT` @def TIMx_CKD_CLK_2_FREQ */
#define TIMx_CKD_CLK_2_FREQ								((timer_clock_division_t) 0x01U)
/** @brief Timer clock division is `t_DTS = 4 * t_CK_INT` @def TIMx_CKD_CLK_4_FREQ */
#define TIMx_CKD_CLK_4_FREQ								((timer_clock_division_t) 0x02U)

/**
 * @brief Checks whether a Timer clock-division selector is valid
 * @param[in]	clockDivision	Timer clock-division selector
 * @returns Clock-division validity status
 * @retval - `0x00U`: @p clockDivision is not supported
 * @retval - `0x01U`: @p clockDivision is supported
 * @def TIM_CLOCK_DIVISION_IS_VALID
 */
#define TIM_CLOCK_DIVISION_IS_VALID(clockDivision)							\
(																			\
	(((timer_clock_division_t) (clockDivision)) == TIMx_CKD_CLK_FREQ) ||		\
	(((timer_clock_division_t) (clockDivision)) == TIMx_CKD_CLK_2_FREQ) ||	\
	(((timer_clock_division_t) (clockDivision)) == TIMx_CKD_CLK_4_FREQ)		\
)

/** @} */ // TIM_03_Driver_02_Defines_04_Counter

// ==================================================================================================== //
//										Timer Channel Mode Selectors									//
// ==================================================================================================== //

/**
 * @brief Timer capture/compare channel selectors
 * @defgroup TIM_03_Driver_02_Defines_05_ChannelConfig Timer Channel Config Defines
 * @ingroup TIM_03_Driver_02_Defines
 * @{
 */

/** @brief Freeze output compare output @def TIMx_CHANNEL_MODE_FREEZE */
#define TIMx_CHANNEL_MODE_FREEZE						((timer_channel_mode_t) 0x00U)
/** @brief Set output compare output active on match @def TIMx_CHANNEL_MODE_SET_CH */
#define TIMx_CHANNEL_MODE_SET_CH						((timer_channel_mode_t) 0x01U)
/** @brief Reset output compare output inactive on match @def TIMx_CHANNEL_MODE_RESET_CH */
#define TIMx_CHANNEL_MODE_RESET_CH						((timer_channel_mode_t) 0x02U)
/** @brief Toggle output compare output on match @def TIMx_CHANNEL_MODE_TOGGLE */
#define TIMx_CHANNEL_MODE_TOGGLE						((timer_channel_mode_t) 0x03U)
/** @brief Force output compare output inactive @def TIMx_CHANNEL_MODE_FORCE_RESET */
#define TIMx_CHANNEL_MODE_FORCE_RESET					((timer_channel_mode_t) 0x04U)
/** @brief Force output compare output active @def TIMx_CHANNEL_MODE_FORCE_SET */
#define TIMx_CHANNEL_MODE_FORCE_SET						((timer_channel_mode_t) 0x05U)
/** @brief PWM mode 1 @def TIMx_CHANNEL_MODE_PWM1 */
#define TIMx_CHANNEL_MODE_PWM1							((timer_channel_mode_t) 0x06U)
/** @brief PWM mode 2 @def TIMx_CHANNEL_MODE_PWM2 */
#define TIMx_CHANNEL_MODE_PWM2							((timer_channel_mode_t) 0x07U)

/**
 * @brief Checks whether a Timer channel mode selector is valid
 * @param[in]	channelMode	Timer channel mode selector
 * @returns Channel mode validity status
 * @retval - `0x00U`: @p channelMode is not supported
 * @retval - `0x01U`: @p channelMode is supported
 * @def TIM_CHANNEL_MODE_IS_VALID
 */
#define TIM_CHANNEL_MODE_IS_VALID(channelMode)								\
	(((uint32_t) ((timer_channel_mode_t) (channelMode))) <= ((uint32_t) TIMx_CHANNEL_MODE_PWM2))

