GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Inc/timer_defines.h
/** @brief Channel configured as output compare @def TIMx_CHANNEL_CCS_OUTPUT */
#define TIMx_CHANNEL_CCS_OUTPUT						((timer_channel_ccs_t) 0x00U)
/** @brief Input capture maps ICx to TIx @def TIMx_CHANNEL_CCS_INPUT_TIx */
#define TIMx_CHANNEL_CCS_INPUT_TIx					((timer_channel_ccs_t) 0x01U)
/** @brief Input capture maps ICx to adjacent TI input @def TIMx_CHANNEL_CCS_INPUT_TIx_1 */
#define TIMx_CHANNEL_CCS_INPUT_TIx_1				((timer_channel_ccs_t) 0x02U)
/** @brief Input capture maps ICx to TRC @def TIMx_CHANNEL_CCS_INPUT_TRC */
#define TIMx_CHANNEL_CCS_INPUT_TRC					((timer_channel_ccs_t) 0x03U)

/**
 * @brief Checks whether a Timer capture/compare selection selector is valid
 * @param[in]	ccs	Timer capture/compare selection selector
 * @returns Capture/compare selection validity status
 * @retval - `0x00U`: @p ccs is not supported
 * @retval - `0x01U`: @p ccs is supported
 * @def TIM_CHANNEL_CCS_IS_VALID
 */
#define TIM_CHANNEL_CCS_IS_VALID(ccs)										\
	(((uint32_t) ((timer_channel_ccs_t) (ccs))) <= ((uint32_t) TIMx_CHANNEL_CCS_INPUT_TRC))

/** @brief Disable output compare preload @def TIMx_CHANNEL_OC_PRELOAD_DISABLE */
#define TIMx_CHANNEL_OC_PRELOAD_DISABLE				((timer_channel_oc_preload_t) 0x00U)
/** @brief Enable output compare preload @def TIMx_CHANNEL_OC_PRELOAD_ENABLE */
#define TIMx_CHANNEL_OC_PRELOAD_ENABLE				((timer_channel_oc_preload_t) 0x01U)

/**
 * @brief Checks whether a Timer output-compare preload selector is valid
 * @param[in]	ocPreload	Timer output-compare preload selector
 * @returns Output-compare preload validity status
 * @retval - `0x00U`: @p ocPreload is not supported
 * @retval - `0x01U`: @p ocPreload is supported
 * @def TIM_CHANNEL_OC_PRELOAD_IS_VALID
 */
#define TIM_CHANNEL_OC_PRELOAD_IS_VALID(ocPreload)										\
(																						\
	(((timer_channel_oc_preload_t) (ocPreload)) == TIMx_CHANNEL_OC_PRELOAD_DISABLE) ||	\
	(((timer_channel_oc_preload_t) (ocPreload)) == TIMx_CHANNEL_OC_PRELOAD_ENABLE)		\
)

/** @brief Disable output compare fast mode @def TIMx_CHANNEL_OC_FAST_DISABLE */
#define TIMx_CHANNEL_OC_FAST_DISABLE					((timer_channel_oc_fast_t) 0x00U)
/** @brief Enable output compare fast mode @def TIMx_CHANNEL_OC_FAST_ENABLE */
#define TIMx_CHANNEL_OC_FAST_ENABLE						((timer_channel_oc_fast_t) 0x01U)

/**
 * @brief Checks whether a Timer output-compare fast selector is valid
 * @param[in]	ocFast	Timer output-compare fast selector
 * @returns Output-compare fast validity status
 * @retval - `0x00U`: @p ocFast is not supported
 * @retval - `0x01U`: @p ocFast is supported
 * @def TIM_CHANNEL_OC_FAST_IS_VALID
 */
#define TIM_CHANNEL_OC_FAST_IS_VALID(ocFast)								\
(																			\
	(((timer_channel_oc_fast_t) (ocFast)) == TIMx_CHANNEL_OC_FAST_DISABLE) ||	\
	(((timer_channel_oc_fast_t) (ocFast)) == TIMx_CHANNEL_OC_FAST_ENABLE)		\
)

/** @brief Disable output compare clear mode @def TIMx_CHANNEL_OC_CLEAR_DISABLE */
#define TIMx_CHANNEL_OC_CLEAR_DISABLE					((timer_channel_oc_clear_t) 0x00U)
/** @brief Enable output compare clear mode @def TIMx_CHANNEL_OC_CLEAR_ENABLE */
#define TIMx_CHANNEL_OC_CLEAR_ENABLE					((timer_channel_oc_clear_t) 0x01U)

/**
 * @brief Checks whether a Timer output-compare clear selector is valid
 * @param[in]	ocClear	Timer output-compare clear selector
 * @returns Output-compare clear validity status
 * @retval - `0x00U`: @p ocClear is not supported
 * @retval - `0x01U`: @p ocClear is supported
 * @def TIM_CHANNEL_OC_CLEAR_IS_VALID
 */
#define TIM_CHANNEL_OC_CLEAR_IS_VALID(ocClear)									\
(																				\
	(((timer_channel_oc_clear_t) (ocClear)) == TIMx_CHANNEL_OC_CLEAR_DISABLE) ||	\
	(((timer_channel_oc_clear_t) (ocClear)) == TIMx_CHANNEL_OC_CLEAR_ENABLE)		\
)

/** @brief Channel active-high polarity @def TIMx_CHANNEL_POLARITY_HIGH */
#define TIMx_CHANNEL_POLARITY_HIGH						((timer_channel_polarity_t) 0x00U)
/** @brief Channel active-low polarity @def TIMx_CHANNEL_POLARITY_LOW */
#define TIMx_CHANNEL_POLARITY_LOW						((timer_channel_polarity_t) 0x01U)

/**
 * @brief Checks whether a Timer channel polarity selector is valid
 * @param[in]	polarity	Timer channel polarity selector
 * @returns Channel polarity validity status
 * @retval - `0x00U`: @p polarity is not supported
 * @retval - `0x01U`: @p polarity is supported
 * @def TIM_CHANNEL_POLARITY_IS_VALID
 */
#define TIM_CHANNEL_POLARITY_IS_VALID(polarity)									\
(																				\
	(((timer_channel_polarity_t) (polarity)) == TIMx_CHANNEL_POLARITY_HIGH) ||	\
	(((timer_channel_polarity_t) (polarity)) == TIMx_CHANNEL_POLARITY_LOW)		\
)

/** @} */ // TIM_03_Driver_02_Defines_05_ChannelConfig

// ==================================================================================================== //
//												Timer IRQ												//
// ==================================================================================================== //

/**
 * @brief Timer IRQ selectors and validation helpers
 * @defgroup TIM_03_Driver_02_Defines_06_IRQ Timer IRQ Defines
 * @ingroup TIM_03_Driver_02_Defines
 * @{
 */

/** @brief Timer IRQ disabled selector @def TIMx_IRQ_DISABLE */
#define TIMx_IRQ_DISABLE							((timer_irq_enable_t) 0x00U)
/** @brief Timer IRQ enabled selector @def TIMx_IRQ_ENABLE */
#define TIMx_IRQ_ENABLE								((timer_irq_enable_t) 0x01U)

/**
 * @brief Checks whether a Timer IRQ enable selector is valid
 * @param[in]	irqEnable	Timer IRQ enable selector
 * @returns IRQ enable selector validity status
 * @retval - `0x00U`: @p irqEnable is not supported
 * @retval - `0x01U`: @p irqEnable is supported
 * @def TIM_IRQ_ENABLE_IS_VALID
 */
#define TIM_IRQ_ENABLE_IS_VALID(irqEnable)						\
(																\
	(((timer_irq_enable_t) (irqEnable)) == TIMx_IRQ_DISABLE) ||	\
	(((timer_irq_enable_t) (irqEnable)) == TIMx_IRQ_ENABLE)		\
)

/** @brief Timer update overflow/underflow IRQ selector @def TIMx_IRQ_OVF_UVF */
#define TIMx_IRQ_OVF_UVF							((timer_irq_t) 0x01U)
/** @brief Timer output compare channel 1 IRQ selector @def TIMx_IRQ_OUT_CMP_CH1 */
#define TIMx_IRQ_OUT_CMP_CH1						((timer_irq_t) 0x02U)
/** @brief Timer output compare channel 2 IRQ selector @def TIMx_IRQ_OUT_CMP_CH2 */
#define TIMx_IRQ_OUT_CMP_CH2						((timer_irq_t) 0x04U)
/** @brief Timer output compare channel 3 IRQ selector @def TIMx_IRQ_OUT_CMP_CH3 */
#define TIMx_IRQ_OUT_CMP_CH3						((timer_irq_t) 0x08U)
/** @brief Timer output compare channel 4 IRQ selector @def TIMx_IRQ_OUT_CMP_CH4 */
#define TIMx_IRQ_OUT_CMP_CH4						((timer_irq_t) 0x10U)
/** @brief Timer input capture channel 1 IRQ selector @def TIMx_IRQ_IN_CAP_CH1 */
#define TIMx_IRQ_IN_CAP_CH1							TIMx_IRQ_OUT_CMP_CH1
/** @brief Timer input capture channel 2 IRQ selector @def TIMx_IRQ_IN_CAP_CH2 */
#define TIMx_IRQ_IN_CAP_CH2							TIMx_IRQ_OUT_CMP_CH2
/** @brief Timer input capture channel 3 IRQ selector @def TIMx_IRQ_IN_CAP_CH3 */
#define TIMx_IRQ_IN_CAP_CH3							TIMx_IRQ_OUT_CMP_CH3
/** @brief Timer input capture channel 4 IRQ selector @def TIMx_IRQ_IN_CAP_CH4 */
#define TIMx_IRQ_IN_CAP_CH4							TIMx_IRQ_OUT_CMP_CH4
/** @brief All supported Timer IRQ selectors @def TIMx_IRQ_ALL */
#define TIMx_IRQ_ALL								((timer_irq_t) 0x1FU)

/**
 * @brief Checks if a Timer IRQ mask selects at least one IRQ source
 * @param[in]	irqMask	Timer IRQ mask to check
 * @returns IRQ-selection presence status
 * @retval - `0x00U`: @p irqMask selects no IRQ source
 * @retval - `0x01U`: @p irqMask selects at least one IRQ source
 * @def TIM_IRQ_MASK_HAS_ANY_IRQ
 */
#define TIM_IRQ_MASK_HAS_ANY_IRQ(irqMask)			\
	(((timer_irq_t) (irqMask)) != ((timer_irq_t) 0x00U))

/**
 * @brief Checks if a Timer IRQ mask contains only supported IRQ source bits
 * @param[in]	irqMask	Timer IRQ mask to check
 * @returns Supported-range status
 * @retval - `0x00U`: @p irqMask contains bits outside @ref `TIMx_IRQ_ALL`
 * @retval - `0x01U`: @p irqMask contains only supported IRQ source bits
 * @def TIM_IRQ_MASK_HAS_ONLY_VALID_IRQs
 */
#define TIM_IRQ_MASK_HAS_ONLY_VALID_IRQs(irqMask)	\
	((((uint32_t) (irqMask)) & (~((uint32_t) TIMx_IRQ_ALL))) == 0x00000000UL)

/**
 * @brief Checks if a Timer IRQ mask is valid and non-empty
 * @param[in]	irqMask	Timer IRQ mask to check
 * @returns IRQ-mask validity status
 * @retval - `0x00U`: @p irqMask is empty or contains unsupported bits
 * @retval - `0x01U`: @p irqMask selects one or more supported IRQ sources
 * @def TIM_IRQ_MASK_IS_VALID
 */
#define TIM_IRQ_MASK_IS_VALID(irqMask)				\
	(TIM_IRQ_MASK_HAS_ANY_IRQ(irqMask) && TIM_IRQ_MASK_HAS_ONLY_VALID_IRQs(irqMask))

/** @} */ // TIM_03_Driver_02_Defines_06_IRQ

// ==================================================================================================== //
//												Timer DMA												//
// ==================================================================================================== //

/**
 * @brief Timer DMA source selectors and validation helpers
 * @defgroup TIM_03_Driver_02_Defines_07_DMA Timer DMA Defines
 * @ingroup TIM_03_Driver_02_Defines
 * @{
 */

