GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/Timer/Inc/timer_defines.h
/** @brief Timer update DMA selector @def TIMx_DMA_UPDATE */
#define TIMx_DMA_UPDATE							((timer_dma_t) 0x01U)
/** @brief Timer capture/compare channel 1 DMA selector @def TIMx_DMA_CC1DE */
#define TIMx_DMA_CC1DE							((timer_dma_t) 0x02U)
/** @brief Timer capture/compare channel 2 DMA selector @def TIMx_DMA_CC2DE */
#define TIMx_DMA_CC2DE							((timer_dma_t) 0x04U)
/** @brief Timer capture/compare channel 3 DMA selector @def TIMx_DMA_CC3DE */
#define TIMx_DMA_CC3DE							((timer_dma_t) 0x08U)
/** @brief Timer capture/compare channel 4 DMA selector @def TIMx_DMA_CC4DE */
#define TIMx_DMA_CC4DE							((timer_dma_t) 0x10U)
/** @brief All supported Timer DMA selectors @def TIMx_DMA_ALL */
#define TIMx_DMA_ALL							((timer_dma_t) 0x1FU)

/**
 * @brief Checks whether a Timer DMA mask is valid and non-empty
 * @param[in]	dmaMask	Timer DMA mask to check
 * @returns DMA-mask validity status
 * @retval - `0x00U`: @p dmaMask is empty or contains unsupported bits
 * @retval - `0x01U`: @p dmaMask selects one or more supported DMA sources
 * @def TIM_DMA_MASK_IS_VALID
 */
#define TIM_DMA_MASK_IS_VALID(dmaMask)			\
	((((timer_dma_t) (dmaMask)) != ((timer_dma_t) 0x00U)) && ((((uint32_t) (dmaMask)) & (~((uint32_t) TIMx_DMA_ALL))) == 0x00000000UL))

/** @} */ // TIM_03_Driver_02_Defines_07_DMA

// ==================================================================================================== //
//											Timer Trigger Modes											//
// ==================================================================================================== //

/**
 * @brief Timer master/slave mode selectors
 * @defgroup TIM_03_Driver_02_Defines_08_Trigger Timer Trigger Defines
 * @ingroup TIM_03_Driver_02_Defines
 * @{
 */

/** @brief Master mode reset trigger output @def TIMx_MMS_RESET */
#define TIMx_MMS_RESET								((timer_master_mode_t) 0x00U)
/** @brief Master mode counter enable trigger output @def TIMx_MMS_ENABLE */
#define TIMx_MMS_ENABLE								((timer_master_mode_t) 0x01U)
/** @brief Master mode update trigger output @def TIMx_MMS_UPDATE */
#define TIMx_MMS_UPDATE								((timer_master_mode_t) 0x02U)
/** @brief Master mode compare pulse trigger output @def TIMx_MMS_CMP_PULSE */
#define TIMx_MMS_CMP_PULSE							((timer_master_mode_t) 0x03U)
/** @brief Master mode output compare 1 reference trigger output @def TIMx_MMS_CMP_OC1REF */
#define TIMx_MMS_CMP_OC1REF							((timer_master_mode_t) 0x04U)
/** @brief Master mode output compare 2 reference trigger output @def TIMx_MMS_CMP_OC2REF */
#define TIMx_MMS_CMP_OC2REF							((timer_master_mode_t) 0x05U)
/** @brief Master mode output compare 3 reference trigger output @def TIMx_MMS_CMP_OC3REF */
#define TIMx_MMS_CMP_OC3REF							((timer_master_mode_t) 0x06U)
/** @brief Master mode output compare 4 reference trigger output @def TIMx_MMS_CMP_OC4REF */
#define TIMx_MMS_CMP_OC4REF							((timer_master_mode_t) 0x07U)

/**
 * @brief Checks whether a Timer master-mode selector is valid
 * @param[in]	masterMode	Timer master-mode selector
 * @returns Master-mode validity status
 * @retval - `0x00U`: @p masterMode is not supported
 * @retval - `0x01U`: @p masterMode is supported
 * @def TIM_MASTER_MODE_IS_VALID
 */
#define TIM_MASTER_MODE_IS_VALID(masterMode)		\
	(((uint32_t) ((timer_master_mode_t) (masterMode))) <= ((uint32_t) TIMx_MMS_CMP_OC4REF))

/** @brief Slave mode disabled @def TIMx_SMS_DISABLE */
#define TIMx_SMS_DISABLE							((timer_slave_mode_t) 0x00U)
/** @brief Encoder mode 1 @def TIMx_SMS_ENC_MODE1 */
#define TIMx_SMS_ENC_MODE1							((timer_slave_mode_t) 0x01U)
/** @brief Encoder mode 2 @def TIMx_SMS_ENC_MODE2 */
#define TIMx_SMS_ENC_MODE2							((timer_slave_mode_t) 0x02U)
/** @brief Encoder mode 3 @def TIMx_SMS_ENC_MODE3 */
#define TIMx_SMS_ENC_MODE3							((timer_slave_mode_t) 0x03U)

/**
 * @brief Checks whether a Timer slave-mode selector is valid for the current public vocabulary
 * @param[in]	slaveMode	Timer slave-mode selector
 * @returns Slave-mode validity status
 * @retval - `0x00U`: @p slaveMode is not supported
 * @retval - `0x01U`: @p slaveMode is supported
 * @def TIM_SLAVE_MODE_IS_VALID
 */
#define TIM_SLAVE_MODE_IS_VALID(slaveMode)			\
	(((uint32_t) ((timer_slave_mode_t) (slaveMode))) <= ((uint32_t) TIMx_SMS_ENC_MODE3))

/** @} */ // TIM_03_Driver_02_Defines_08_Trigger

// ==================================================================================================== //
//											Timer Remap Selectors										//
// ==================================================================================================== //

/**
 * @brief Timer alternate-function remap selectors
 * @defgroup TIM_03_Driver_02_Defines_09_Remap Timer Remap Defines
 * @ingroup TIM_03_Driver_02_Defines
 * @{
 */

/** @brief TIM1 no remap selector @def TIM1_NO_REMAP */
#define TIM1_NO_REMAP								((timer_remap_t) 0x00U)
/** @brief TIM1 partial remap selector @def TIM1_PARTIAL_REMAP */
#define TIM1_PARTIAL_REMAP							((timer_remap_t) 0x01U)
/** @brief TIM1 reserved remap selector @def TIM1_NOT_USED_REMAP */
#define TIM1_NOT_USED_REMAP							((timer_remap_t) 0x02U)
/** @brief TIM1 full remap selector @def TIM1_FULL_REMAP */
#define TIM1_FULL_REMAP								((timer_remap_t) 0x03U)
/** @brief TIM2 no remap selector @def TIM2_NO_REMAP */
#define TIM2_NO_REMAP								((timer_remap_t) 0x00U)
/** @brief TIM2 partial remap 1 selector @def TIM2_PARTIAL1_REMAP */
#define TIM2_PARTIAL1_REMAP							((timer_remap_t) 0x01U)
/** @brief TIM2 partial remap 1 compatibility alias @def TIM2_PARTIAL_REMAP_1 */
#define TIM2_PARTIAL_REMAP_1							TIM2_PARTIAL1_REMAP
/** @brief TIM2 partial remap 2 selector @def TIM2_PARTIAL2_REMAP */
#define TIM2_PARTIAL2_REMAP							((timer_remap_t) 0x02U)
/** @brief TIM2 partial remap 2 compatibility alias @def TIM2_PARTIAL_REMAP_2 */
#define TIM2_PARTIAL_REMAP_2							TIM2_PARTIAL2_REMAP
/** @brief TIM2 full remap selector @def TIM2_FULL_REMAP */
#define TIM2_FULL_REMAP								((timer_remap_t) 0x03U)
/** @brief TIM3 no remap selector @def TIM3_NO_REMAP */
#define TIM3_NO_REMAP								((timer_remap_t) 0x00U)
/** @brief TIM3 reserved remap selector @def TIM3_NOT_USED_REMAP */
#define TIM3_NOT_USED_REMAP							((timer_remap_t) 0x01U)
/** @brief TIM3 partial remap selector @def TIM3_PARTIAL_REMAP */
#define TIM3_PARTIAL_REMAP							((timer_remap_t) 0x02U)
/** @brief TIM3 full remap selector @def TIM3_FULL_REMAP */
#define TIM3_FULL_REMAP								((timer_remap_t) 0x03U)
/** @brief TIM4 no remap selector @def TIM4_NO_REMAP */
#define TIM4_NO_REMAP								((timer_remap_t) 0x00U)
/** @brief TIM4 full remap selector @def TIM4_FULL_REMAP */
#define TIM4_FULL_REMAP								((timer_remap_t) 0x01U)

/** @} */ // TIM_03_Driver_02_Defines_09_Remap

/** @} */ // TIM_03_Driver_02_Defines

/** @} */ // TIM_03_Driver

// --- C++ Compatibility ---
#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* TIMER_DEFINES_H_ */
